Repository: ViollaM/converty
Catalog: locales/*/LC_MESSAGES/converty.po
Languages: fr, ru

source: Hi, dear {fname}, my name is Converty and I am file converter bot 😎 Use /help command to find out what I can do
fr: Salut, cher {fname}, je m'appelle Converty et je suis un bot de conversion de fichiers 😎 Utilisez la commande / help pour savoir ce que je peux faire
ru: Привет, {fname}, меня зовут Converty и я бот-конвертер файлов 😎 Используй команду /help, чтобы узнать, что я умею

source: Goodbye, dear {fname}
fr: À bientôt, cher {fname}
ru: Пока, {fname}

source: Please specify one convertation format
fr: Spécifiez un format de conversion s'il tu plait
ru: Пожалуйста, выбери один формат конвертации

source: Oops, this format is not supported yet 😔️️️ Choose supported one from: {formats}
fr: Oups, ce format n'est pas encore supporté 😔️️️ Choisissez l'un des formats pris en charge: {formats}
ru: Упс, этот формат еще не поддерживается 😔️️️ Выбери один из поддерживаемых форматов из: {formats}

source: Something went wrong, please try again later
fr: Quelque chose s'est mal passé, veuillez réessayer plus tard
ru: Что-то пошло не так, пожалуйста, попробуй еще раз позже

source: All uploaded files deleted
fr: Tous les fichiers téléchargés supprimés
ru: Все загруженные файлы удалены

source: Please specify one language
fr: Spécifiez une langue s'il tu plait
ru: Пожалуйста, выбери один язык

source: Unfortunately, this language is not supported yet 😔️️️ Choose supported one from: {langs}
fr: Malheureusement, cette langue n'est pas encore prise en charge 😔️️️ Choisissez celui pris en charge parmi: {langs}
ru: К сожалению, этот язык еще не поддерживается 😔️️️ Выбери один из поддерживаемых из: {langs}

source: Language successfully changed
fr: La langue a été modifiée avec succès
ru: Язык сменен успешно

source: Supported formats: {formats} Pdf file will be compiled from files of the following types: {pdf_formats}, the remaining files will be ignored, but will remain among the uploaded ones. Zip file will be compiled from all uploaded files. Unzip option can only unzip one file at a time, will return all files from archive. Images option can only extract images from one pdf file at a time, will return all pages as png files.
fr: Formats pris en charge: {formats} Le fichier Pdf sera compilé à partir des fichiers des types suivants:{pdf_formats}, les fichiers restants seront ignorés, mais resteront parmiceux téléchargés. Le fichier Zip sera compilé à partir de tous les fichiers téléchargés. L'option Unzip ne peut décompresser qu'un seul fichier à la fois, retournera tous les fichiers des archives. L'option Images ne peut extraire des images que d'un seul fichier pdf à la fois,renvoie toutes les pages sous forme de fichiers png.
ru: Поддерживаемые форматы: {formats} Pdf файл может быть создан только из файлов следующих типов: {pdf_formats}, остальные файлы будут проигнорированы, но останутся среди загруженных. Zip файл будет создан из всех загруженных файлов. Опция unzip может разархивировать только один файл за раз, вернет все файлы из архива. Опция images может извлекать изображения только из одного pdf файла за раз, вернет все страницы документа как png файлы.

source: Launching bot
fr: Lancement du bot
ru: Запуск бота

source: Stopping bot, all uploaded files will be deleted You'll need to use command /start to resume the work with bot
fr: Arrêt du bot, tous les fichiers téléchargés seront supprimés Tu dois utiliser commande /start pour reprendre le travail avec le bot
ru: Остановка бота, все загруженные файлы будут удалены Для возобновления работы с ботом нужно будет использовать команду /start

source: Delete all uploaded files
fr: Supprimer tous les fichiers téléchargés
ru: Удаляет все загруженные файлы

source: Changes bot language, supported languages: {langs}
fr: Change la langue du bot, langues prises en charge: {langs}
ru: Меняет язык бота, поддерживаемые языки: {langs}

source: Write a feedback about our service
fr: Écrivez un commentaire sur notre service
ru: Напишите отзыв о нашем сервисе

source: Add your email address to get the processed files on it
fr: Ajoutez votre adresse e-mail pour obtenir les fichiers traités dessus
ru: Добавьте электронную почту для получения файлов

source: I don't recognize this command
fr: Je ne reconnais pas cette commande
ru: Я не знаю такой команды

source: Please specify one command
fr: Spécifiez une commande s'il tu plait
ru: Пожалуйста, выбери одну команду

source: Thanks for your feedback!
fr: Merci pour vos commentaires!
ru: Спасибо за ваш отзыв!

source: Write something please
fr: Écrivez quelque chose s'il vous plaît
ru: Напишите что-нибудь, пожалуйста

source: Email updated!
fr: E-mail mis à jour !
ru: Адрес электронной почты успешно изменен!

source: Write your email, please
fr: Écrivez votre e-mail, s'il vous plaît
ru: Напишите, пожалуйста, адрес вашей электронной почты

source: Photo uploaded!
fr: Photo téléchargée!
ru: Фото загружено!

source: Document uploaded!
fr: Document téléchargé!
ru: Документ загружен!
